app/Controllers/CiudadanosController.php

    public function verCiudadanos(): string
    {
        $ciudadanos = new CiudadanosModel();
        $datos['datos']=$ciudadanos->findAll();
---
SELECT *
FROM `ciudadanos`