app/Controllers/RegionesController.php

SELECT *
FROM `regiones`
---
    public function verRegiones(): string
    {
        $regiones = new RegionesModel();
        $datos['datos']=$regiones->findAll();

INSERT INTO `regiones` (`cod_region`, `nombre`, `descripcion`) VALUES ('9', 'Extranjero', 'Fuera del país')
---
    public function guardarRegion()
    {
        $regiones = new RegionesModel();
        $datos = [
            'cod_region' => $this->request->getPost('txtCodReg'),
            'nombre' => $this->request->getPost('txtNombreRegion'),
            'descripcion' => $this->request->getPost('txtDescripcion')
        ];
        print_r($datos);
        $regiones->insert($datos);

DELETE FROM `regiones`
WHERE `cod_region` IN ('9')
---
    public function eliminarRegion($cod=null)
    {
        $regiones = New RegionesModel();
        $regiones->delete(['cod_region'=>$cod]);

SELECT *
FROM `regiones`
WHERE `cod_region` = '9'
 LIMIT 1
---
    public function actualizarRegion($cod=null)
    {
        $regiones = new RegionesModel();
        $datos['datos']=$regiones->where(['cod_region'=>$cod])->first();